app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def authorize_request
    # grab auth header
    header = request.headers['Authorization']
    # split token from header
    header = header.split(' ').last if header
    begin
      # decode to pull user info from token
      @decoded = decode(header)
      # set instance variable to using user_id
      @current_user = User.find(@decoded[:id])