app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Loon22"], ["LIMIT", 1]]
---
  def login
    # find user based on provided username
    @user = User.find_by(username: login_params[:username])