app/controllers/fit_classes_controller.rb

SELECT "studios".* FROM "studios" WHERE "studios"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index
    @studio = Studio.find(params[:studio_id])

INSERT INTO "fit_classes" ("class_name", "schedule_time", "studio_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["class_name", "Yin"], ["schedule_time", "2021-06-25 20:18:00"], ["studio_id", 3], ["created_at", "2021-06-26 01:20:35.487808"], ["updated_at", "2021-06-26 01:20:35.487808"]]
---
  def create
    @fit_class = FitClass.new(fit_class_params)

    if @fit_class.save

UPDATE "fit_classes" SET "schedule_time" = $1, "updated_at" = $2 WHERE "fit_classes"."id" = $3  [["schedule_time", "2021-06-26 15:47:00"], ["updated_at", "2021-06-26 20:47:52.905738"], ["id", 1]]
---
  def update
    if @fit_class.update(fit_class_params)

DELETE FROM "fit_classes" WHERE "fit_classes"."id" = $1  [["id", 5]]
---
  def destroy
    @fit_class.destroy

SELECT "fit_classes".* FROM "fit_classes" WHERE "fit_classes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_fit_class
      @fit_class = FitClass.find(params[:id])