app/controllers/studios_controller.rb

  def index
    @studios = Studio.all
---
SELECT "studios".* FROM "studios"

  def create
    @studio = Studio.new(studio_params)

    # assign association to the current_user
    @studio.user = @current_user

    if @studio.save
---
INSERT INTO "studios" ("business_name", "location", "blurb", "format", "image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @current_user.studio.update(studio_params)
---
UPDATE "studios" SET "business_name" = $1, "format" = $2, "updated_at" = $3 WHERE "studios"."id" = $4  [["business_name", "SpaceJam"], ["format", "weight-lifting"], ["updated_at", "2021-06-26 18:43:36.482792"], ["id", 3]]

    def set_studio
      @studio = Studio.find(params[:id])
---
SELECT "studios".* FROM "studios" WHERE "studios"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]